In [58]:
import pandas as pd
import numpy as np

from UtilityFunctions.get_data_path import get_path
from UtilityFunctions.flatten_dict import flatten_dictionary
from UtilityFunctions.run_query import run_query

In [ ]:
businesses = pd.read_json(get_path("yelp_academic_dataset_business.json"), lines=True)
users = pd.read_json(get_path("yelp_academic_dataset_user.json"), lines=True)

# Businesses

### Number of businesses

In [2]:
sparql_query = """

SELECT COUNT(?business)
WHERE {
    ?business rdfs:Class schema:LocalBusiness .
}

"""

run_query(query=sparql_query, as_dataframe=True)

  callret-0.type                        callret-0.datatype callret-0.value
0  typed-literal  http://www.w3.org/2001/XMLSchema#integer          150346

In [3]:
len(businesses["business_id"].unique())

150346

### Distribution of ratings

In [148]:
sparql_query = """

SELECT ?business ?rating STR(?rating)
FROM <http://www.yelpkg.com/business>
WHERE {
    ?business rdfs:Class schema:LocalBusiness .
    ?business schema:starRating ?rating .
}
LIMIT 10

"""

run_query(query=sparql_query, as_dataframe=True)

,business.type,business.value,rating.type,rating.datatype,rating.value,callret-2.type,callret-2.value
0,uri,https://example.org/business_id/-a7VXX0-V9LgWMFrq90iNA,typed-literal,http://www.w3.org/2001/XMLSchema#float,3.5,literal,3.5
1,uri,https://example.org/business_id/0UqeZTDBdV0uY3wesbLvYQ,typed-literal,http://www.w3.org/2001/XMLSchema#float,4.0,literal,4
2,uri,https://example.org/business_id/1jx1sfgjgVg0nM6n3p0xWA,typed-literal,http://www.w3.org/2001/XMLSchema#float,4.5,literal,4.5
3,uri,https://example.org/business_id/2MAQeAqmD8enCT2ZYqUgIQ,typed-literal,http://www.w3.org/2001/XMLSchema#float,4.0,literal,4
4,uri,https://example.org/business_id/2O2K6SXPWv56amqxCECd4w,typed-literal,http://www.w3.org/2001/XMLSchema#float,4.5,literal,4.5
5,uri,https://example.org/business_id/5Z8iBpJMmOMz6G_7oVnzRA,typed-literal,http://www.w3.org/2001/XMLSchema#float,2.5,literal,2.5
6,uri,https://example.org/business_id/7omkeqEv-kKMIn9kmOR6Lw,typed-literal,http://www.w3.org/2001/XMLSchema#float,5.0,literal,5
7,uri,https://example.org/business_id/7xc84taj12pt-RtZhAfSkQ,typed-literal,http://www.w3.org/2001/XMLSchema#float,5.0,literal,5
8,uri,https://example.org/business_id/8n93L-ilMAsvwUatarykSg,typed-literal,http://www.w3.org/2001/XMLSchema#float,3.0,literal,3
9,uri,https://example.org/business_id/9RGR4_r4PJLTooNmscUE_A,typed-literal,http://www.w3.org/2001/XMLSchema#float,4.0,literal,4

In [88]:
sparql_query = """

select ?x, (str(?x) as ?sx) {
  values ?x { 
    "1.11111"^^xsd:float
    "1.11115"^^xsd:float
    "1.11119"^^xsd:float
  }
}

"""

run_query(query=sparql_query, as_dataframe=True)

,x.type,x.datatype,x.value,sx.type,sx.value
0,typed-literal,http://www.w3.org/2001/XMLSchema#float,1.11111,literal,1.111109972000122
1,typed-literal,http://www.w3.org/2001/XMLSchema#float,1.11115,literal,1.111150026321411
2,typed-literal,http://www.w3.org/2001/XMLSchema#float,1.11119,literal,1.111189961433411

In [95]:
sparql_query = """

SELECT ROUND(?rating * 10) / 10 AS ?round_rating COUNT(?rating) AS ?count_businesses
FROM <http://www.yelpkg.com/business>
WHERE {
    ?business rdfs:Class schema:LocalBusiness .
    ?business schema:starRating ?rating .
}
GROUP BY (ROUND(?rating * 10) / 10)
ORDER BY (ROUND(?rating * 10) / 10)

"""

run_query(query=sparql_query, as_dataframe=True)

,round_rating.type,round_rating.datatype,round_rating.value,count_businesses.type,count_businesses.datatype,count_businesses.value
0,typed-literal,http://www.w3.org/2001/XMLSchema#float,1.0,typed-literal,http://www.w3.org/2001/XMLSchema#integer,1986
1,typed-literal,http://www.w3.org/2001/XMLSchema#float,1.5,typed-literal,http://www.w3.org/2001/XMLSchema#integer,4932
2,typed-literal,http://www.w3.org/2001/XMLSchema#float,2.0,typed-literal,http://www.w3.org/2001/XMLSchema#integer,9527
3,typed-literal,http://www.w3.org/2001/XMLSchema#float,2.5,typed-literal,http://www.w3.org/2001/XMLSchema#integer,14316
4,typed-literal,http://www.w3.org/2001/XMLSchema#float,3.0,typed-literal,http://www.w3.org/2001/XMLSchema#integer,18453
5,typed-literal,http://www.w3.org/2001/XMLSchema#float,3.5,typed-literal,http://www.w3.org/2001/XMLSchema#integer,26519
6,typed-literal,http://www.w3.org/2001/XMLSchema#float,4.0,typed-literal,http://www.w3.org/2001/XMLSchema#integer,31125
7,typed-literal,http://www.w3.org/2001/XMLSchema#float,4.5,typed-literal,http://www.w3.org/2001/XMLSchema#integer,27181
8,typed-literal,http://www.w3.org/2001/XMLSchema#float,5.0,typed-literal,http://www.w3.org/2001/XMLSchema#integer,16307

In [47]:
businesses.groupby('stars')['stars'].count()

stars
1.0     1986
1.5     4932
2.0     9527
2.5    14316
3.0    18453
3.5    26519
4.0    31125
4.5    27181
5.0    16307
Name: stars, dtype: int64

### Total average rating

In [11]:
sparql_query = """

SELECT AVG(?rating) as ?averagerating
FROM <http://www.yelpkg.com/business>
WHERE {
    ?business rdfs:Class schema:LocalBusiness .
    ?business schema:starRating ?rating .
}

"""

run_query(query=sparql_query, as_dataframe=True)

,averagerating.type,averagerating.datatype,averagerating.value
0,typed-literal,http://www.w3.org/2001/XMLSchema#decimal,3.59672355766033

In [12]:
businesses['stars'].mean()

3.5967235576603303

### Number of businesses in different geographical regions

In [129]:
sparql_query = """

SELECT ?state ?city COUNT(?business) AS ?count_business
FROM <http://www.yelpkg.com/business>
WHERE {
    ?business rdfs:Class schema:LocalBusiness .
    ?business schema:addressRegion ?state .
    ?business schema:location ?city .
}
GROUP BY ?state ?city
ORDER BY DESC(?count_business)
LIMIT 10

"""

run_query(query=sparql_query, as_dataframe=True)[["state.value", "city.value", "count_business.value"]]

  state.value     city.value count_business.value
0          PA   Philadelphia                14567
1          AZ         Tucson                 9249
2          FL          Tampa                 9048
3          IN   Indianapolis                 7540
4          TN      Nashville                 6968
5          LA    New Orleans                 6208
6          NV           Reno                 5932
7          AB       Edmonton                 5054
8          MO    Saint Louis                 4827
9          CA  Santa Barbara                 3829

In [126]:
businesses.groupby(["state", "city"])["business_id"].count().sort_values(ascending=False)[0:10]

state  city
PA     Philadelphia     14567
AZ     Tucson            9249
FL     Tampa             9048
IN     Indianapolis      7540
TN     Nashville         6968
LA     New Orleans       6208
NV     Reno              5932
AB     Edmonton          5054
MO     Saint Louis       4827
CA     Santa Barbara     3829
Name: business_id, dtype: int64

### Different categories and numbers of businesses within that category

In [145]:
sparql_query = """

SELECT ?category COUNT(?business) AS ?count_business
WHERE {
    ?business rdfs:Class schema:LocalBusiness .
    ?business schema:category ?category .
}
GROUP BY ?category
ORDER BY DESC(?count_business)
LIMIT 5
"""

run_query(query=sparql_query, as_dataframe=True)

,category.type,category.datatype,category.value,count_business.type,count_business.datatype,count_business.value
0,typed-literal,http://www.w3.org/2001/XMLSchema#string,Restaurants,typed-literal,http://www.w3.org/2001/XMLSchema#integer,52268
1,typed-literal,http://www.w3.org/2001/XMLSchema#string,Food,typed-literal,http://www.w3.org/2001/XMLSchema#integer,27781
2,typed-literal,http://www.w3.org/2001/XMLSchema#string,Shopping,typed-literal,http://www.w3.org/2001/XMLSchema#integer,24395
3,typed-literal,http://www.w3.org/2001/XMLSchema#string,Home Services,typed-literal,http://www.w3.org/2001/XMLSchema#integer,14356
4,typed-literal,http://www.w3.org/2001/XMLSchema#string,Beauty & Spas,typed-literal,http://www.w3.org/2001/XMLSchema#integer,14292

In [146]:
def str_split(string):
    if isinstance(string, str):
        return string.split(", ")
    else:
        return string


businesses["categories"] = businesses["categories"].apply(str_split)

category_biz_count = {}
for i in range(len(businesses)):
    if businesses["categories"][i]:
        for category in businesses["categories"][i]:
            category_biz_count[category] = category_biz_count.get(category, 0) + 1

category_biz_count["Beauty & Spas"]

14292

# Users

### Number of Users

In [37]:
sparql_query = """

SELECT COUNT(?users)
FROM <http://www.yelpkg.com/user>
WHERE {
    ?user rdfs:Class schema:Person .
}
"""

run_query(query=sparql_query, as_dataframe=True)

  callret-0.type                        callret-0.datatype callret-0.value
0  typed-literal  http://www.w3.org/2001/XMLSchema#integer               0

In [38]:
len(users["user_id"].unique())

1987897